Revit 2027 API
ParameterTypeId.ReferenceOtherViewUiRefView Property
 "Reference View": This is used by the UI to allow selection of view reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ReferenceOtherViewUiRefView { get; }
Public Shared ReadOnly Property ReferenceOtherViewUiRefView As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ReferenceOtherViewUiRefView {
	ForgeTypeId^ get ();
}
static member ReferenceOtherViewUiRefView : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace